In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('scr-dataset.csv')
df

        x         y
0     1.0  1.750768
1     1.1  1.699704
2     1.2  1.607502
3     1.3  1.479060
4     1.4  1.320438
..    ...       ...
435  44.5  1.354955
436  44.6  1.523446
437  44.7  1.648505
438  44.8  1.727490
439  44.9  1.759403

[440 rows x 2 columns]

## Points to note
1. x is at a stepping range from 1.0 to 44.0 with a step = 0.1
2. Explaining the 440 rows

In [3]:
df.describe()

                x           y
count  440.000000  440.000000
mean    22.950000    0.000708
std     12.716131    1.001561
min      1.000000   -1.760149
25%     11.975000   -0.571808
50%     22.950000   -0.002649
75%     33.925000    0.592413
max     44.900000    1.760160

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 440 entries, 0 to 439
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x       440 non-null    float64
 1   y       440 non-null    float64
dtypes: float64(2)
memory usage: 7.0 KB

## No null values